import pytest
from playwright.sync_api import sync_playwright, Page

@pytest.fixture # по дефолту должен открываться на каждый тест, поэтому скоуп не прописываем
def chromium_page() -> Page:
    with sync_playwright() as playwright:
        browser = playwright.chromium.launch(headless=False)
        yield browser.new_page()
        browser.close()

# Разберем что мы сделали, мы создали фикстуру со скоупом фанкшен (по умолчанию), фикстура выполняет повторяющиеся
# действия в автотестах - использовать данную фикстуру можно в области папки на тесты, которые есть в самой папке
# Открытие хромиума, и иницилизация новой страницы и далее страница возвращается внутрь теста
# Итого в тестах остается сама логика теста, а иницилизация страницы уехала в конфтест - что делает код более чистым